
# Brewfile managed by chezmoi
# Place this file at ~/.local/share/chezmoi/Brewfile
# chezmoi will copy it to ~/.config/chezmoi/Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Development
brew "node"
brew "python"
brew "ruby"
brew "golang"
brew "rust"
brew "lazygit"

# Build tools
brew "cmake"
brew "make"

# Version control & tools
brew "gh"  # GitHub CLI
brew "git-lfs"

# Text editors
brew "nano"
brew "neovim"

# Utilities
brew "jq"  # JSON processor
brew "yq"  # YAML processor
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "htop"
brew "tldr"
brew "eza"
brew "zoxide"
brew "fastfetch"

# Shell
brew "zsh"